Documents/ЛБ_ИнвентаризацияДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_ИнвентаризацияДС</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ИнициаторыИнвентаризации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПриказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриказа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаУчетная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаФактическая</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отклонение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтклонениеБулево</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>МОЛы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИнвентаризационнаяКомиссия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Председатель</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дистанционно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЛБ_ТекущийЛомбардПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ТекущийЛомбардПользователя</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ЛБ_ДенежныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_ДенежныеСредства</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_КадроваяИсторияСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_КадроваяИсторияСотрудников</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыКадровыхСобытий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ОтделенияЛомбардов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ОтделенияЛомбардов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОтделенияЛомбардов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Центральный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_ДолжностиДляИнвентаризационнойКомиссии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ДолжностиДляИнвентаризационнойКомиссии</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_ВидыДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_ВидыКадровыхСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыКадровыхСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Прием</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Увольнение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачальныеДанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВосстановлениеВДолжности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеподтвержденныеДанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеОплатыТруда</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ЛБ_Сотрудники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЛБ_Сотрудники</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийПроцентСевернойНадбавки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УточнениеНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнойСотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриема</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаЧас</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ЛБ_ИнвентаризацияДС/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Перем НеРедактировать Экспорт;

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ БСП

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	//ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры 

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	Если Параметры.Ключ.Пустая() Тогда
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Организация = Константы.ЛБ_ОсновнаяОрганизация.Получить();
		//Объект.Ответственный = Пользователи.ТекущийПользователь().Сотрудник;
		//ЛомбардСсылка = ПолучитьСсылкуЛомбарда();
		//Объект.Должность = Пользователи.ТекущийПользователь().Сотрудник.Должность;
		
		//Если ЗначениеЗаполнено(ЛомбардСсылка) Тогда
		Если ПараметрыСеанса.ТекущийПользователь.ЭтоЛомбард Тогда
			Объект.Должность = ПараметрыСеанса.ТекущийСотрудник.Должность;
			Объект.Ответственный = ПараметрыСеанса.ТекущийСотрудник;
			Объект.Ломбард = ПараметрыСеанса.ТекущийЛомбард; //ЛомбардСсылка;
		Иначе
			Объект.Должность = Пользователи.ТекущийПользователь().Сотрудник.Должность;
			Объект.Ответственный = Пользователи.ТекущийПользователь().Сотрудник;
			ЛомбардПользователя = РегистрыСведений.ЛБ_ТекущийЛомбардПользователя.Получить(Новый Структура("Пользователь", Пользователи.ТекущийПользователь()));
			Объект.Ломбард = ЛомбардПользователя.Ломбард;
		КонецЕсли;
		
		ЗаполнитьТЧ();
		ДобавитьМОЛ();
	КонецЕсли;

	ПроверитьНаличиеПредседателя();

КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере()

	ТекущаяДатаДокумента = Объект.Дата;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры  
   
&НаКлиенте
Процедура УстановитьВидимость()

	Если Объект.Проведен Тогда
		НеРедактировать = Истина;
		Элементы.ДекорацияСтатусДокумента.Заголовок = "Факт"; 
		Элементы.ДекорацияСтатусДокумента.ЦветТекста = WebЦвета.ТемноБордовый;  
		Элементы.ДекорацияСтатусДокумента.ЦветФона = WebЦвета.ТусклоРозовый;
		ЭтотОбъект.ТолькоПросмотр = НеРедактировать;
	Иначе
		НеРедактировать = Ложь;
		Элементы.ДекорацияСтатусДокумента.Заголовок = "Проект"; 
		Элементы.ДекорацияСтатусДокумента.ЦветТекста = WebЦвета.ТемноЗеленый;
		Элементы.ДекорацияСтатусДокумента.ЦветФона = WebЦвета.СветлоЗеленый;
		ЭтотОбъект.ТолькоПросмотр = НеРедактировать;
	КонецЕсли;

	ЛомбардСсылка = ПолучитьСсылкуЛомбарда();
	
	Если ЗначениеЗаполнено(ЛомбардСсылка) Тогда
		Элементы.Ломбард.ТолькоПросмотр = Истина;
	Иначе
		Элементы.Ломбард.ТолькоПросмотр = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЛомбардНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Если Объект.СуммаУчетная <> 0 И Объект.СуммаФактическая <> 0 Тогда
		
		Ответ = Вопрос("При изменении ломбарда очистятся суммы.
					   |Изменить ломбард?", РежимДиалогаВопрос.ДаНет);
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Объект.СуммаУчетная = 0;
			Объект.СуммаФактическая = 0;
			Объект.Отклонение = 0;
		Иначе
	        СтандартнаяОбработка = Ложь;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСсылкуЛомбарда()
	Возврат ЛБ_ОбщийМодуль.ПолучитьСсылкуЛомбарда();
КонецФункции	

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьУчетныеИфактическиеДанные();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУчетныеИфактическиеДанные()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ДенежныеСредстваОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ЛБ_ДенежныеСредства.Остатки(
		|			&Дата,
		|			Организация = &Организация
		|				И ВидДенежныхСредств = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыДенежныхСредств.Наличные)
		|				И Ломбард = &Ломбард) КАК ЛБ_ДенежныеСредстваОстатки";
	
	Запрос.УстановитьПараметр("Дата", НачалоДня(Объект.Дата));
	Запрос.УстановитьПараметр("Ломбард", Объект.Ломбард);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Объект.СуммаУчетная = Результат.СуммаОстаток;
		Объект.СуммаФактическая = Результат.СуммаОстаток;
	КонецЕсли;
	
	Объект.Отклонение = Объект.СуммаФактическая - Объект.СуммаУчетная;
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаФактическаяПриИзменении(Элемент)
	Объект.Отклонение = Объект.СуммаФактическая - Объект.СуммаУчетная;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.Отклонение <> 0 Тогда
		Объект.ОтклонениеБулево = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Тип) Тогда
		Объект.Тип = "Инвентаризация";
	КонецЕсли;
	
	Если ПараметрыЗаписи.РежимЗаписи = ПредопределенноеЗначение("РежимЗаписиДокумента.Проведение") Тогда
		
		ВсеЗаполнено = ПроверитьЗаполнениеТЧ();
		Если НЕ ВсеЗаполнено Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Ответ = Вопрос("После проведения документа отмена изменений будет невозможна.
						|Провести документ?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Отказ = Ложь;
		Иначе
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПечататьАкт(Команда)
	Если Объект.Проведен Тогда 
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ИменаМакетов", "АктНаличныхДС"); 
		ПараметрыФормы.Вставить("ИмяМенеджераПечати", "Документ.ЛБ_ИнвентаризацияДС");
		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(Объект.Ссылка);
		ПараметрыФормы.Вставить("ПараметрКоманды", МассивОбъектов);
		ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыФормы, ЭтаФорма,,,,,);   
	Иначе
		Предупреждение("Перед печатью необходимо провести документ!");
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьЗаполнениеТЧ()
	
	//ЕстьПредседатель = Объект.ИнвентаризационнаяКомиссия.НайтиСтроки(Новый Структура("Председатель", Истина));
	
	Если Объект.МОЛы.Количество() = 0 Тогда
		Предупреждение("Не заполнены МОЛ. Проведение документа запрещено!");
		Возврат Ложь;
	ИначеЕсли Объект.ИнвентаризационнаяКомиссия.Количество() = 0 Тогда
		Предупреждение("Не заполнены члены комиссии. Проведение документа запрещено!");
		Возврат Ложь;
	ИначеЕсли НЕ ЕстьПредседатель Тогда //.Количество() = 0 Тогда
		Предупреждение("Не выбран председатель комиссии. Проведение документа запрещено!");
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ДатаПриказаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Если Элемент.ТекстРедактирования > Строка(Формат(Объект.Дата, "ДФ=dd.MM.yyyy")) Тогда
		Предупреждение("Дата приказа не может быть больше даты документа!");
		Объект.ДатаПриказа = Дата(1,1,1);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриказаОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	Если ВыбранноеЗначение > Объект.Дата Тогда
		Предупреждение("Дата приказа не может быть больше даты документа!");
		ВыбранноеЗначение = Дата(1,1,1);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧ()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_Инвентаризация.Ссылка КАК Ссылка,
		|	ЛБ_Инвентаризация.ИнвентаризационнаяКомиссия.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		ФизЛицо КАК ФизЛицо,
		|		Председатель КАК Председатель,
		|		Дистанционно КАК Дистанционно,
		|		Должность КАК Должность
		|	) КАК ИнвентаризационнаяКомиссия,
		|	ЛБ_Инвентаризация.МОЛы.(
		|		Ссылка КАК Ссылка,
		|		НомерСтроки КАК НомерСтроки,
		|		ФизЛицо КАК ФизЛицо,
		|		Должность КАК Должность
		|	) КАК МОЛы
		|ИЗ
		|	Документ.ЛБ_Инвентаризация КАК ЛБ_Инвентаризация
		|ГДЕ
		|	НЕ ЛБ_Инвентаризация.ПометкаУдаления
		|	И ЛБ_Инвентаризация.Ломбард = &Ломбард
		|	И ЛБ_Инвентаризация.Дата МЕЖДУ &ДатаНач И &ДатаКон";
	
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ДатаКон", ТекущаяДата());
	Запрос.УстановитьПараметр("Ломбард", Объект.Ломбард);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Объект.ИнвентаризационнаяКомиссия.Загрузить(Результат.ИнвентаризационнаяКомиссия.Выгрузить());
		Объект.МОЛы.Загрузить(Результат.МОЛы.Выгрузить());
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьМОЛ()
	
	Если ПараметрыСеанса.ТекущийПользователь.ЭтоЛомбард Тогда
		Сотр = ПараметрыСеанса.ТекущийСотрудник;
	Иначе
		Сотр = Пользователи.ТекущийПользователь().Сотрудник;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("ФизЛицо", Сотр); // Пользователи.ТекущийПользователь().Сотрудник);
	
	ЕстьСотрудник = Объект.МОЛы.НайтиСтроки(Отбор);
	Если ЕстьСотрудник.Количество() = 0 Тогда
		СтрМОЛы = Объект.МОЛы.Добавить();
		СтрМОЛы.ФизЛицо = Сотр;
		СтрМОЛы.Должность = Сотр.Должность;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСотрудниковМОЛ()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрСведений.ЛБ_КадроваяИсторияСотрудников.СрезПоследних(
		|			&Дата,
		|			Подразделение В
		|				(ВЫБРАТЬ
		|					ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард КАК Ломбард
		|				ИЗ
		|					РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(&Дата, Отделение В
		|						(ВЫБРАТЬ
		|							ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение КАК Отделение
		|						ИЗ
		|							РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(&Дата, Ломбард = &Ломбард) КАК ЛБ_ОтделенияЛомбардовСрезПоследних)) КАК ЛБ_ОтделенияЛомбардовСрезПоследних
		|				ГДЕ
		|					НЕ ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард.Закрыт)) КАК ЛБ_КадроваяИсторияСотрудниковСрезПоследних
		|ГДЕ
		|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыКадровыхСобытий.Увольнение)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Сотрудник.Наименование";
	
	Запрос.УстановитьПараметр("Дата", ?(Объект.Дата = Дата(1,1,1), ТекущаяДата(), НачалоДня(Объект.Дата)));
	Запрос.УстановитьПараметр("Ломбард", Объект.Ломбард);
	
	//Возврат Запрос.Выполнить().Выгрузить();
	Результат = Запрос.Выполнить().Выгрузить();
	
	МассивВозврата = Новый Массив;
	
	Для каждого Стр Из Результат Цикл
		МассивВозврата.Добавить(Стр.Сотрудник);
	КонецЦикла;
	
	Возврат МассивВозврата;
	
КонецФункции

&НаКлиенте
Процедура МОЛыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)

	Если Объект.МОЛы.Количество() = 3 Тогда
		Предупреждение("Достигнуто максимально допустимое количество материально ответственных лиц.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораСотрудникаМОЛ", ЭтаФорма);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("МассивСотрудников", ПолучитьСотрудниковМОЛ());
	
	ОткрытьФорму("Справочник.ЛБ_Сотрудники.Форма.ФормаВыбораСотрудников",ПараметрыФормы,,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораСотрудникаМОЛ(Результат, ДопПараметры) Экспорт
	
	Отбор = Новый Структура;
	
	Если Результат <> Неопределено Тогда
		Отбор.Вставить("ФизЛицо", Результат);
		
		НайденныеСтроки = Объект.МОЛы.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 0 Тогда
			
			Сообщить("Сотрудник уже выбран.");
			
			Отбор.Вставить("ФизЛицо", Справочники.ЛБ_Сотрудники.ПустаяСсылка());
			
			НайденныеСтроки = Объект.МОЛы.НайтиСтроки(Отбор);
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				
				СтрокаДокумента = НайденныеСтроки[НайденныеСтроки.ВГраница()];
				
				ИндексСтр = Объект.МОЛы.Индекс(СтрокаДокумента);;
				Объект.МОЛы.Удалить(ИндексСтр);
				Возврат;
			КонецЕсли;
		КонецЕсли;			
	КонецЕсли;
	
	Отбор.Вставить("ФизЛицо", Справочники.ЛБ_Сотрудники.ПустаяСсылка());
	
	НайденныеСтроки = Объект.МОЛы.НайтиСтроки(Отбор);

	Если НайденныеСтроки.Количество() > 0 Тогда
		
		СтрокаДокумента = НайденныеСтроки[НайденныеСтроки.ВГраница()];
		
		Если Результат = Неопределено Тогда
			ИндексСтр = Объект.МОЛы.Индекс(СтрокаДокумента);;
			Объект.МОЛы.Удалить(ИндексСтр);
			Возврат;
		КонецЕсли;
		
		СтрокаДокумента.ФизЛицо = Результат;
		СтрокаДокумента.Должность = Результат.Должность;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнвентаризационнаяКомиссияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Объект.ИнвентаризационнаяКомиссия.Количество() = 4 Тогда
		Предупреждение("Достигнуто максимально допустимое количество членов инвентаризационной комиссии.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	ОбработкаВыбора = Новый ОписаниеОповещения("ПослеВыбораСотрудникаИК", ЭтаФорма);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("МассивСотрудников", ПолучитьСотрудниковИК());
	
	ОткрытьФорму("Справочник.ЛБ_Сотрудники.Форма.ФормаВыбораСотрудников",ПараметрыФормы,,,,,ОбработкаВыбора, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораСотрудникаИК(Результат, ДопПараметры) Экспорт
	
	Отбор = Новый Структура;
	
	Если Результат <> Неопределено Тогда
		Отбор.Вставить("ФизЛицо", Результат);
		
		НайденныеСтроки = Объект.ИнвентаризационнаяКомиссия.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 0 Тогда
			
			Сообщить("Сотрудник уже выбран.");
			
			Отбор.Вставить("ФизЛицо", Справочники.ЛБ_Сотрудники.ПустаяСсылка());
			
			НайденныеСтроки = Объект.ИнвентаризационнаяКомиссия.НайтиСтроки(Отбор);
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				
				СтрокаДокумента = НайденныеСтроки[НайденныеСтроки.ВГраница()];
				
				ИндексСтр = Объект.ИнвентаризационнаяКомиссия.Индекс(СтрокаДокумента);;
				Объект.ИнвентаризационнаяКомиссия.Удалить(ИндексСтр);
				Возврат;
			КонецЕсли;
		КонецЕсли;			
	КонецЕсли;
	
	Отбор.Вставить("ФизЛицо", Справочники.ЛБ_Сотрудники.ПустаяСсылка());
	
	НайденныеСтроки = Объект.ИнвентаризационнаяКомиссия.НайтиСтроки(Отбор);

	Если НайденныеСтроки.Количество() > 0 Тогда
		
		СтрокаДокумента = НайденныеСтроки[НайденныеСтроки.ВГраница()];
		
		Если Результат = Неопределено Тогда
			ИндексСтр = Объект.ИнвентаризационнаяКомиссия.Индекс(СтрокаДокумента);;
			Объект.ИнвентаризационнаяКомиссия.Удалить(ИндексСтр);
			Возврат;
		КонецЕсли;
		
		СтрокаДокумента.ФизЛицо = Результат;
		СтрокаДокумента.Должность = Результат.Должность;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСотрудниковИК()
	
	//Ломбарды
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
		|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность КАК Должность
		|ИЗ
		|	РегистрСведений.ЛБ_КадроваяИсторияСотрудников.СрезПоследних(
		|			&Дата,
		|			ВЫБОР
		|				КОГДА Подразделение = ЗНАЧЕНИЕ(Справочник.ЛБ_Ломбарды.ПустаяСсылка)
		|					ТОГДА ИСТИНА
		|				КОГДА Подразделение В
		|						(ВЫБРАТЬ
		|							ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард КАК Ломбард
		|						ИЗ
		|							РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(&Дата, Отделение В
		|								(ВЫБРАТЬ
		|									ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение КАК Отделение
		|								ИЗ
		|									РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(&Дата, Ломбард = &Ломбард) КАК ЛБ_ОтделенияЛомбардовСрезПоследних)) КАК ЛБ_ОтделенияЛомбардовСрезПоследних
		|						ГДЕ
		|							НЕ ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард.Закрыт)
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ) КАК ЛБ_КадроваяИсторияСотрудниковСрезПоследних
		|ГДЕ
		|	НЕ ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность В
		|				(ВЫБРАТЬ
		|					ЛБ_ДолжностиДляИнвентаризационнойКомиссии.Должность КАК Должность
		|				ИЗ
		|					РегистрСведений.ЛБ_ДолжностиДляИнвентаризационнойКомиссии КАК ЛБ_ДолжностиДляИнвентаризационнойКомиссии)
		|	И ЛБ_КадроваяИсторияСотрудниковСрезПоследних.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыКадровыхСобытий.Увольнение)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Сотрудник.Наименование";
	
	Запрос.УстановитьПараметр("Дата", ?(Объект.Дата = Дата(1,1,1), ТекущаяДата(), НачалоДня(Объект.Дата)));
	Запрос.УстановитьПараметр("Ломбард", Объект.Ломбард);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	МассивВозврата = Новый Массив;
	
	Пока Результат.Следующий() Цикл
		МассивВозврата.Добавить(Результат.Сотрудник);
	КонецЦикла;
	
	Возврат МассивВозврата;
	
КонецФункции

&НаКлиенте
Процедура ПечатьПустойАкт(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИменаМакетов", "ПустойАкт"); 
	ПараметрыФормы.Вставить("ИмяМенеджераПечати", "Документ.ЛБ_ИнвентаризацияДС");
	МассивОбъектов = Новый Массив;
	МассивОбъектов.Добавить(ПредопределенноеЗначение("Документ.ЛБ_ИнвентаризацияДС.ПустаяСсылка")); //Объект.Ссылка);
	ПараметрыФормы.Вставить("ПараметрКоманды", МассивОбъектов);
	ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыФормы, ЭтаФорма,,,,,);   
КонецПроцедуры

&НаКлиенте
Процедура ИнвентаризационнаяКомиссияПредседательПриИзменении(Элемент)
	Если НЕ ЕстьПредседатель Тогда
		ЕстьПредседатель = Истина;
	ИначеЕсли НЕ Элементы.ИнвентаризационнаяКомиссия.ТекущиеДанные.Председатель	И ЕстьПредседатель Тогда
		ЕстьПредседатель = Ложь;
	Иначе
		Предупреждение("Председатель комиссии уже выбран.");
		Элементы.ИнвентаризационнаяКомиссия.ТекущиеДанные.Председатель = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПроверитьНаличиеПредседателя()
	Отбор = Новый Структура;
	Отбор.Вставить("Председатель", Истина);
	
	МассивПредседатель = Объект.ИнвентаризационнаяКомиссия.НайтиСтроки(Отбор);
	
	Если МассивПредседатель.Количество() >= 1 Тогда
		ЕстьПредседатель = Истина;
	Иначе
		ЕстьПредседатель = Ложь;
	КонецЕсли;
КонецПроцедуры
